InsuranceHealth_API/Report/Data/Step2.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">enterClaim</td><td class="value col-head-style">StServiceCallActivity4</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_InputXml_4f2cb1a4-aecd-48b2-9db0-22805bf85a47.xml\', \'Data/StServiceCallActivity4_InputXml_4f2cb1a4-aecd-48b2-9db0-22805bf85a47.js4hrpt\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n  &lt;Header /&gt;\r\n  &lt;Body&gt;\r\n    &lt;enterClaim xmlns="http://hp.com/SOAQ/ServiceSimulation/2010/demo/01"&gt;\r\n      &lt;claim&gt;\r\n        &lt;adjustedAmount xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;1&lt;/adjustedAmount&gt;\r\n        &lt;claimedAmount xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;24&lt;/claimedAmount&gt;\r\n        &lt;date xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;2010-01-01T00:00:00+00:00&lt;/date&gt;\r\n        &lt;description xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;premolar seal&lt;/description&gt;\r\n        &lt;firstName xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;Hercule&lt;/firstName&gt;\r\n        &lt;lastName xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;Poirot&lt;/lastName&gt;\r\n        &lt;memberId xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;\r\n          &lt;id&gt;-4&lt;/id&gt;\r\n        &lt;/memberId&gt;\r\n        &lt;socialSecurityNumber xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo"&gt;554-98-0001&lt;/socialSecurityNumber&gt;\r\n      &lt;/claim&gt;\r\n    &lt;/enterClaim&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">ClaimProcessing</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">BasicHttpBinding_IClaimProcessing</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">enterClaim</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8102/ServiceSimulation/Demo/ClaimProcessingService/ClaimProcessingService</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">http://hp.com/SOAQ/ServiceSimulation/2010/demo/01/IClaimProcessing/enterClaim</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_Full_request_34da1bbc-2230-4c0f-8847-53c7991eed23.xml\', \'Data/StServiceCallActivity4_Full_request_34da1bbc-2230-4c0f-8847-53c7991eed23.js4hrpt\', \'.xml\', \'Full request\');return false;">&lt;?xml version="1.0"? ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	http://hp.com/SOAQ/ServiceSimulation/2010/demo/01/IClaimProcessing/enterClaim\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8102\nContent-Length:	1167\nExpect:	100-continue\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	377\nContent-Type:	text/xml; charset=utf-8\nDate:	Fri, 15 May 2020 17:48:50 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;enterClaimResponse xmlns="http://hp.com/SOAQ/ServiceSimulation/2010/demo/01"&gt;&lt;enterClaimResult xmlns:a="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;a:id&gt;1&lt;/a:id&gt;&lt;/enterClaimResult&gt;&lt;/enterClaimResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_OutputXml_7a6d27e5-6c1f-4e4e-825c-33d5b97fb762.xml\', \'Data/StServiceCallActivity4_OutputXml_7a6d27e5-6c1f-4e4e-825c-33d5b97fb762.js4hrpt\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;enterClaimResponse xmlns="http://hp.com/SOAQ/ServiceSimulation/2010/demo/01"&gt;\r\n      &lt;enterClaimResult xmlns:a="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n        &lt;a:id&gt;1&lt;/a:id&gt;\r\n      &lt;/enterClaimResult&gt;\r\n    &lt;/enterClaimResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}