InsuranceHealth_API/Log/vtd_user.log

2020-05-15 18:48:47,884 [1] INFO  - Loaded appender: FileAppenderExternal
2020-05-15 18:48:47,962 [1] INFO  - Loaded appender: UserLoggerAppender
2020-05-15 18:48:47,962 [1] INFO  - Loaded appender: FileAppenderInternal
2020-05-15 18:48:47,963 [1] INFO  - Loaded appender: FileAppenderExternal
2020-05-15 18:48:47,963 [1] INFO  - Loaded appender: UserLoggerAppender
2020-05-15 18:48:47,963 [1] INFO  - Loaded appender: FileAppenderInternal
2020-05-15 18:48:50,296 [18] INFO  - Step 'Start' : Step 'Start' started
2020-05-15 18:48:50,483 [18] INFO  - Step 'Start' ended successfully
2020-05-15 18:48:50,484 [18] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2020-05-15 18:48:50,487 [18] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2020-05-15 18:48:50,490 [18] INFO  - Step 'enterClaim' : Step 'enterClaim' started
2020-05-15 18:48:50,629 [18] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Header />
  <Body>
    <enterClaim xmlns="http://hp.com/SOAQ/ServiceSimulation/2010/demo/01">
      <claim>
        <adjustedAmount xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">1</adjustedAmount>
        <claimedAmount xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">24</claimedAmount>
        <date xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">2010-01-01T00:00:00+00:00</date>
        <description xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">premolar seal</description>
        <firstName xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">Hercule</firstName>
        <lastName xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">Poirot</lastName>
        <memberId xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">
          <id>-4</id>
        </memberId>
        <socialSecurityNumber xmlns="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo">554-98-0001</socialSecurityNumber>
      </claim>
    </enterClaim>
  </Body>
</Envelope>

2020-05-15 18:48:50,648 [18] INFO  - URL: http://localhost:8102/ServiceSimulation/Demo/ClaimProcessingService/ClaimProcessingService
2020-05-15 18:48:50,686 [18] INFO  - Returning the response to the previous channel
2020-05-15 18:48:50,691 [18] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <enterClaimResponse xmlns="http://hp.com/SOAQ/ServiceSimulation/2010/demo/01">
      <enterClaimResult xmlns:a="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:id>1</a:id>
      </enterClaimResult>
    </enterClaimResponse>
  </s:Body>
</s:Envelope>

2020-05-15 18:48:51,069 [18] INFO  - Structural Validation: True
2020-05-15 18:48:51,077 [18] ERROR - Checkpoint 1: "1" > "1" failed
2020-05-15 18:48:51,080 [18] INFO  - Step 'enterClaim' ended successfully
2020-05-15 18:48:51,082 [18] INFO  - Step 'Iteration 1' ended successfully
2020-05-15 18:48:51,085 [18] INFO  - Step 'Test Flow' ended successfully
2020-05-15 18:48:51,086 [18] INFO  - Step 'End' : Step 'End' started
2020-05-15 18:48:51,107 [18] INFO  - Step 'End' ended successfully
